000_РОЗНИЦА_ЦЕНТР/src/Catalogs/Магазины/Магазины.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Магазины</name>
  <attributes>
    <name>Блокирован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВведенВЭксплуатацию</name>
    <comment>Магазин переведен в режим работы 1С:Розница</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДеятельности</name>
    <type>
      <types>CatalogRef.ВидыДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидМинимальныхЦенПродажи</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>Город</name>
    <type>
      <types>CatalogRef.Города</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаПользователей</name>
    <type>
      <types>CatalogRef.ГруппыПользователей</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаФизЛиц</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаРаботы</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьОрдернуюСхемуПриОтгрузке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьОрдернуюСхемуПриОтраженииИзлишковНедостач</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьОрдернуюСхемуПриПеремещении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьОрдернуюСхемуПриПоступлении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПрименениеЦен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПрямуюИнкассацию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КассаМагазина</name>
    <comment>Основная денежная касса магазина</comment>
    <type>
      <types>CatalogRef.Кассы</types>
    </type>
  </attributes>
  <attributes>
    <name>КодБюджета</name>
    <type>
      <types>CatalogRef.КодыБюджетов</types>
    </type>
  </attributes>
  <attributes>
    <name>КодФилиала</name>
    <comment>Navision</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонтролироватьАссортимент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерМагазина</name>
    <comment>Используется для начальной загрузки из MForce</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбособленноеПодразделениеОрганизации</name>
    <comment>Определяет филиал</comment>
    <type>
      <types>CatalogRef.ОбособленныеПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтменаРучныхСкидок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПерсональныеПродажи</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подпись</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокОкругленияСуммыЧекаВПользуПокупателя</name>
    <type>
      <types>EnumRef.ПорядкиОкругления</types>
    </type>
  </attributes>
  <attributes>
    <name>ПравилоЦенообразования</name>
    <type>
      <types>CatalogRef.ПравилаЦенообразования</types>
    </type>
  </attributes>
  <attributes>
    <name>СегментИсключаемойНоменклатуры</name>
    <type>
      <types>CatalogRef.СегментыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладПереброски</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладПоступления</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладПродажи</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладСвязи</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладУправляющейСистемы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматМагазина</name>
    <type>
      <types>CatalogRef.ФорматыМагазинов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Область</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <comment>Свойство</comment>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <comment>Значение</comment>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

000_РОЗНИЦА_ЦЕНТР/src/Catalogs/Магазины/Forms/РазблокированиеРеквизитов/Module.bsl
///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьСписокРеквизитов();
	
	УстановитьВсеОтметкиСервер(Истина);
	
	ИспользоватьАссортимент = АссортиментСервер.ПолучитьФункциональнуюОпциюИспользованияАссортимента();
	Элементы.РазрешитьРедактированиеФорматМагазина.Видимость = ИспользоватьАссортимент;
	Элементы.РазрешитьРедактированиеКонтролироватьАссортимент.Видимость = ИспользоватьАссортимент;
	
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура РазрешитьРедактирование(Команда)

	Результат = Новый Массив;
	Если РазрешитьРедактированиеИспользоватьОрдернуюСхемуПриОтгрузке Тогда
		Результат.Добавить("ИспользоватьОрдернуюСхемуПриОтгрузке");
	КонецЕсли;

	Если РазрешитьРедактированиеИспользоватьОрдернуюСхемуПриОтраженииИзлишковНедостач Тогда
		Результат.Добавить("ИспользоватьОрдернуюСхемуПриОтраженииИзлишковНедостач");
	КонецЕсли;
	
	Если РазрешитьРедактированиеИспользоватьОрдернуюСхемуПриПоступлении Тогда
		Результат.Добавить("ИспользоватьОрдернуюСхемуПриПоступлении");
	КонецЕсли;
	
	Если РазрешитьРедактированиеВидМинимальныхЦенПродажи Тогда
		Результат.Добавить("ВидМинимальныхЦенПродажи");
	КонецЕсли;
	
	Если РазрешитьРедактированиеИспользоватьПрименениеЦен Тогда
		Результат.Добавить("ИспользоватьПрименениеЦен");
	КонецЕсли;

	Если РазрешитьРедактированиеПравилоЦенообразования Тогда
		Результат.Добавить("ПравилоЦенообразования");
	КонецЕсли;
	
	Если РазрешитьРедактированиеСкладПоступления Тогда
		Результат.Добавить("СкладПоступления");
	КонецЕсли;
	
	Если РазрешитьРедактированиеСкладПродажи Тогда
		Результат.Добавить("СкладПродажи");
	КонецЕсли;
	
	Если РазрешитьРедактированиеСегментИсключаемойИзСкидокНоменклатуры Тогда
		Результат.Добавить("СегментИсключаемойНоменклатуры");
	КонецЕсли;
	
	Если РазрешитьРедактированиеПорядокОкругленияСуммыЧекаВПользуПокупателя Тогда
		Результат.Добавить("ПорядокОкругленияСуммыЧекаВПользуПокупателя");
	КонецЕсли;
	
	Если Элементы.РазрешитьРедактированиеФорматМагазина.Видимость И РазрешитьРедактированиеФорматМагазина Тогда
		Результат.Добавить("ФорматМагазина");
	КонецЕсли;
	
	Если Элементы.РазрешитьРедактированиеКонтролироватьАссортимент.Видимость И РазрешитьРедактированиеКонтролироватьАссортимент Тогда
		Результат.Добавить("КонтролироватьАссортимент");
	КонецЕсли;
	
	Если РазрешитьРедактированиеИспользоватьПрямуюИнкассацию Тогда
		Результат.Добавить("ИспользоватьПрямуюИнкассацию");
	КонецЕсли;

//	LNK 17.11.2016 11:19:27
	Если РазрешитьРедактированиеКодФилиала Тогда

		Результат.Добавить("КодФилиала");

	КонецЕсли;

	Если РазрешитьРедактированиеНомерМагазина Тогда

		Результат.Добавить("НомерМагазина");

	КонецЕсли;

	Если РазрешитьРедактированиеВведенВЭксплуатацию Тогда

		Результат.Добавить("ВведенВЭксплуатацию");

	КонецЕсли;

	Если РазрешитьРедактированиеДатаНачалаРаботы Тогда

		Результат.Добавить("ДатаНачалаРаботы");

	КонецЕсли;

	Если РазрешитьРедактированиеКассаМагазина Тогда

		Результат.Добавить("КассаМагазина");

	КонецЕсли;

	Если РазрешитьРедактированиеСкладПереброски Тогда

		Результат.Добавить("СкладПереброски");

	КонецЕсли;

	Если РазрешитьРедактированиеГород Тогда

		Результат.Добавить("Город");

	КонецЕсли;

	Если РазрешитьРедактированиеБлокирован Тогда

		Результат.Добавить("Блокирован");

	КонецЕсли;

	Если РазрешитьРедактированиеОбособленноеПодразделениеОрганизации Тогда

		Результат.Добавить("ОбособленноеПодразделениеОрганизации");

	КонецЕсли;

	Если РазрешитьРедактированиеВидДеятельности Тогда

		Результат.Добавить("ВидДеятельности");

	КонецЕсли;

	Закрыть(Результат);

КонецПроцедуры

&НаКлиенте
Процедура УстановитьВсеОтметки(Команда)
	
	УстановитьВсеОтметкиКлиент(Истина)
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсеОтметки(Команда)
	
	УстановитьВсеОтметкиКлиент(Ложь)
	
КонецПроцедуры


///////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура ЗаполнитьСписокРеквизитов()
	
	Для каждого ЭлементФормы Из Элементы Цикл
		Если ТипЗнч(ЭлементФормы) = Тип("ПолеФормы") 
			И Найти(ЭлементФормы.Имя, "РазрешитьРедактирование") = 1 Тогда
			СписокРеквизитов.Добавить(ЭлементФормы.Имя);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВсеОтметкиСервер(ЗначениеОтметки)
	
	Для каждого ЭлементСписка из СписокРеквизитов Цикл
		
		ЭтотОбъект[ЭлементСписка.Значение] = ЗначениеОтметки;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВсеОтметкиКлиент(ЗначениеОтметки)
	
	Для каждого ЭлементСписка из СписокРеквизитов Цикл
		
		ЭтотОбъект[ЭлементСписка.Значение] = ЗначениеОтметки;
		
	КонецЦикла;
	
КонецПроцедуры
